<template>
    <svg class="auth-bg" width="1920" height="1080" viewBox="0 0 1920 1080" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M2119.71 1099.38C1351.01 529.746 1026.63 1076.46 801.327 334.79C624.523 -247.23 431.348 -340.024 160.995 -333.212" stroke="#D01F1F"/>
<path d="M1840.12 1642.62C1071.42 1072.99 747.037 1619.7 521.736 878.031C344.932 296.011 151.757 203.217 -118.596 210.029" stroke="#D01F1F"/>
<path d="M2108.04 1122.07C1339.34 552.442 1014.95 1099.16 789.648 357.486C612.845 -224.534 419.669 -317.328 149.316 -310.516" stroke="#D01F1F"/>
<path d="M2096.6 1144.3C1327.9 574.665 1003.51 1121.38 778.211 379.709C601.408 -202.311 408.233 -295.105 137.88 -288.293" stroke="#D01F1F"/>
<path d="M2085.4 1166.05C1316.7 596.417 992.317 1143.13 767.015 401.462C590.212 -180.559 397.036 -273.353 126.683 -266.541" stroke="#D01F1F"/>
<path d="M2074.45 1187.33C1305.75 617.696 981.365 1164.41 756.064 422.74C579.261 -159.28 386.085 -252.074 115.732 -245.262" stroke="#D01F1F"/>
<path d="M2063.74 1208.13C1295.04 638.503 970.656 1185.22 745.354 443.548C568.551 -138.473 375.375 -231.266 105.022 -224.455" stroke="#D01F1F"/>
<path d="M2053.28 1228.47C1284.58 658.838 960.191 1205.55 734.889 463.883C558.086 -118.138 364.91 -210.932 94.5574 -204.12" stroke="#D01F1F"/>
<path d="M2043.06 1248.33C1274.36 678.699 949.97 1225.42 724.668 483.744C547.865 -98.2762 354.69 -191.07 84.3367 -184.258" stroke="#D01F1F"/>
<path d="M2033.08 1267.72C1264.38 698.089 939.989 1244.81 714.688 503.134C537.885 -78.8865 344.709 -171.68 74.3563 -164.869" stroke="#D01F1F"/>
<path d="M2023.34 1286.64C1254.64 717.007 930.253 1263.72 704.952 522.052C528.148 -59.968 334.973 -152.762 64.6199 -145.95" stroke="#D01F1F"/>
<path d="M2013.85 1305.08C1245.15 735.452 920.76 1282.17 695.459 540.497C518.655 -41.5231 325.48 -134.317 55.1268 -127.505" stroke="#D01F1F"/>
<path d="M2004.59 1323.06C1235.9 753.425 911.509 1300.14 686.208 558.47C509.404 -23.5501 316.229 -116.344 45.8758 -109.532" stroke="#D01F1F"/>
<path d="M1995.59 1340.56C1226.89 770.926 902.501 1317.64 677.2 575.971C500.396 -6.04939 307.221 -98.8433 36.868 -92.0314" stroke="#D01F1F"/>
<path d="M1986.82 1357.59C1218.12 787.954 893.738 1334.67 668.436 592.999C491.633 10.9788 298.457 -81.8152 28.1043 -75.0033" stroke="#D01F1F"/>
<path d="M1978.3 1374.14C1209.6 804.51 885.218 1351.23 659.917 609.555C483.113 27.5342 289.938 -65.2597 19.5848 -58.4478" stroke="#D01F1F"/>
<path d="M1970.02 1390.22C1201.32 820.594 876.938 1367.31 651.636 625.639C474.833 43.6183 281.657 -49.1756 11.3045 -42.3638" stroke="#D01F1F"/>
<path d="M1961.99 1405.84C1193.29 836.206 868.904 1382.92 643.602 641.25C466.799 59.2302 273.623 -33.5638 3.27032 -26.7519" stroke="#D01F1F"/>
<path d="M1954.2 1420.98C1185.5 851.345 861.111 1398.06 635.809 656.39C459.006 74.3694 265.83 -18.4245 -4.52265 -11.6126" stroke="#D01F1F"/>
<path d="M1946.65 1435.64C1177.95 866.011 853.564 1412.73 628.262 671.056C451.459 89.036 258.283 -3.75792 -12.0695 3.05395" stroke="#D01F1F"/>
<path d="M1939.34 1449.84C1170.64 880.206 846.257 1426.92 620.956 685.25C444.152 103.23 250.977 10.4362 -19.3762 17.2481" stroke="#D01F1F"/>
<path d="M1932.28 1463.56C1163.58 893.928 839.197 1440.64 613.895 698.972C437.092 116.952 243.916 24.1582 -26.4367 30.9701" stroke="#D01F1F"/>
<path d="M1925.46 1476.81C1156.76 907.178 832.376 1453.89 607.075 712.222C430.271 130.202 237.096 37.4082 -33.257 44.2201" stroke="#D01F1F"/>
<path d="M1918.89 1489.59C1150.19 919.955 825.801 1466.67 600.5 725C423.696 142.979 230.521 50.1855 -39.8322 56.9974" stroke="#D01F1F"/>
<path d="M1912.55 1501.89C1143.85 932.26 819.467 1478.98 594.166 737.304C417.362 155.284 224.187 62.4902 -46.1662 69.3021" stroke="#D01F1F"/>
<path d="M1906.46 1513.72C1137.76 944.093 813.377 1490.81 588.076 749.138C411.272 167.118 218.097 74.3236 -52.2561 81.1355" stroke="#D01F1F"/>
<path d="M1900.62 1525.08C1131.92 955.453 807.53 1502.17 582.228 760.498C405.425 178.478 212.249 85.6839 -58.1037 92.4958" stroke="#D01F1F"/>
<path d="M1895.01 1535.97C1126.31 966.342 801.926 1513.06 576.625 771.387C399.821 189.366 206.646 96.5723 -63.7072 103.384" stroke="#D01F1F"/>
<path d="M1889.65 1546.39C1120.95 976.758 796.564 1523.47 571.262 781.802C394.459 199.782 201.283 106.988 -69.0695 113.8" stroke="#D01F1F"/>
<path d="M1884.53 1556.33C1115.83 986.701 791.448 1533.42 566.147 791.746C389.344 209.726 196.168 116.932 -74.1848 123.744" stroke="#D01F1F"/>
<path d="M1879.66 1565.8C1110.96 996.172 786.572 1542.89 561.271 801.217C384.468 219.197 191.292 126.403 -79.0607 133.215" stroke="#D01F1F"/>
<path d="M1875.03 1574.8C1106.33 1005.17 781.942 1551.89 556.64 810.216C379.837 228.196 186.661 135.402 -83.6916 142.214" stroke="#D01F1F"/>
<path d="M1870.64 1583.33C1101.94 1013.7 777.553 1560.41 552.251 818.742C375.448 236.722 182.273 143.928 -88.0803 150.74" stroke="#D01F1F"/>
<path d="M1866.49 1591.38C1097.79 1021.75 773.407 1568.47 548.106 826.797C371.303 244.777 178.127 151.983 -92.2258 158.795" stroke="#D01F1F"/>
<path d="M1862.59 1598.96C1093.89 1029.33 769.506 1576.05 544.205 834.378C367.401 252.358 174.226 159.564 -96.1271 166.376" stroke="#D01F1F"/>
<path d="M1858.93 1606.07C1090.23 1036.44 765.847 1583.16 540.545 841.488C363.742 259.468 170.567 166.674 -99.7863 173.486" stroke="#D01F1F"/>
<path d="M1855.52 1612.71C1086.82 1043.08 762.43 1589.8 537.128 848.126C360.325 266.106 167.15 173.312 -103.203 180.124" stroke="#D01F1F"/>
<path d="M1852.34 1618.88C1083.64 1049.25 759.257 1595.96 533.956 854.291C357.152 272.27 163.977 179.476 -106.376 186.288" stroke="#D01F1F"/>
<path d="M1849.41 1624.57C1080.71 1054.94 756.325 1601.66 531.024 859.984C354.221 277.964 161.045 185.17 -109.308 191.982" stroke="#D01F1F"/>
<path d="M1846.73 1629.79C1078.03 1060.16 753.642 1606.88 528.34 865.203C351.537 283.183 158.362 190.389 -111.991 197.201" stroke="#D01F1F"/>
<path d="M1844.28 1634.54C1075.58 1064.91 751.197 1611.62 525.895 869.952C349.092 287.932 155.916 195.138 -114.437 201.95" stroke="#D01F1F"/>
<path d="M1842.08 1638.81C1073.38 1069.18 748.996 1615.9 523.695 874.228C346.891 292.208 153.716 199.414 -116.637 206.226" stroke="#D01F1F"/>
</svg>

    <div class="auth">
        <a href="/">
            <svg class="auth__back" width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M16.067 29.745L9.52866 22.935C8.74032 22.1367 8.34033 21.0483 8.33366 20C8.33366 18.9433 8.77366 17.8417 9.57199 17.05L16.142 10.3217C16.462 9.99334 16.9903 9.98667 17.3203 10.3083C17.6453 10.63 17.6553 11.1567 17.3337 11.4867L10.7537 18.225C10.477 18.5 10.2753 18.8217 10.152 19.165L30.8337 19.165C31.2937 19.165 31.667 19.5383 31.667 19.9983C31.667 20.4583 31.2937 20.8317 30.8337 20.8317L10.1403 20.8317C10.257 21.1733 10.452 21.495 10.722 21.7683L17.2687 28.5867C17.587 28.92 17.577 29.4483 17.2453 29.765C16.9137 30.0833 16.3837 30.075 16.067 29.7417L16.067 29.745ZM8.33366 20C8.33366 19.985 8.33199 20.0267 8.33366 20V20Z" fill="black"/>
        </svg>
        </a>
        <h2 class="auth__logo">DETAILING.GURU</h2>
        <span class="auth__title">Регистрация</span>
        <div class="auth-info">
            <div>
                <label class="auth__label" for="mail">Имя Фамилия</label>
                <input class="auth__input" type="email" required placeholder="">
            </div>
            <div>
                <label class="auth__label" for="mail">Номер телефона</label>
                <input class="auth__input" type="number" required placeholder="">
            </div>
            <div>
                <label class="auth__label" for="pass">Почта</label>
                <input class="auth__input" type="enail" required placeholder="">
            </div>
            <div>
                <label class="auth__label" for="pass">Пароль</label>
                <input class="auth__input" type="pass" required placeholder="">
            </div>
        </div>
        <div class="auth-wrap">
            <input type="checkbox">
            <p class="auth__text">я даю согласие на обработку <a class="auth__link" href="#">Персональных данных</a></p>
        </div>
        <button class="auth__btn">Создать аккаунт</button>
    </div>
</template>

<style>
body {
    margin: 0;
    padding: 0;
    height: 100vh;
    display: flex;
    justify-content: center;
    align-items: center;
    background-color: #f0f0f0;
}

.auth-bg {
    position: absolute;
    z-index: -1;
    top: 0;
    left: -8%;
    width: 100%;
    height: 100%;
}

.auth__back {
    position: absolute;
    top: 40px;
    left: 20px;
    cursor: pointer;
}

.auth {
    border-radius: 10px;
    background: #FFFFFF;
    box-shadow: 4px 3px 45px 0px rgba(0, 0, 0, 0.25);
    padding: 45px 60px;
    max-width: 570px;
    display: flex;
    flex-direction: column;
    justify-content: center;
    position: relative;
}

.auth__logo {
    margin-bottom: 50px;
    font-family: BOWLER;
    font-size: 36px;
    text-align: center;
}

.auth-info {
    display: flex;
    flex-direction: column;
    gap: 25px;
}

.auth__title {
    font-size: 26px;
    margin-bottom: 26px;
    text-align: center;
    font-weight: 600;
}

.auth__label {
    margin-bottom: 2px;
    display: block;
    font-size: 16px;
    color: #A8A8A8;
}

.auth__input {
    border-radius: 10px;
    background: rgba(236, 236, 236, 0.7);
    width: 100%;
    outline: none;
    border: none;
    padding: 15px;
    color: #454545;
    font-size: 16px;
}

.auth__btn {
    border-radius: 10px;
    background: #10141A;
    font-size: 18px;
    color: #fff;
    width: 100%;
    padding: 12px;
    transition: background .4s ease-in-out;
}

.auth__btn:hover {
    background: #454545;
}

.auth__text {
    font-size: 14px;
}

.auth__text a {
    color: #3C99EA;
    transition: color .4s ease-in-out;
}

.auth__text a:hover {
    color: #0057a3;
}

.auth-wrap {
    margin: 55px 0 15px;
    display: flex;
    align-items: center;
}

input::-webkit-outer-spin-button,
input::-webkit-inner-spin-button {
    -webkit-appearance: none;
}

input[type='number'] {
    -moz-appearance: textfield;
}

.auth-wrap input[type="checkbox"] {
    width: 20px; /* Увеличенный размер чекбокса */
    height: 20px; /* Увеличенный размер чекбокса */
    border: 1px solid #000; /* Обводка */
    appearance: none; /* Убираем стандартное оформление чекбокса */
    outline: none; /* Убираем стандартный фокус */
    cursor: pointer; /* Указатель при наведении */
    display: inline-block; /* Чтобы сохранить размер */
    margin-right: 10px; /* Отступ справа от текста */
    border-radius: 4px; /* Опционально: сделать углы закругленными */
}

.auth-wrap input[type="checkbox"]:checked {
    background-color: #000; /* Цвет фона при выборе */
    border-color: #000; /* Цвет обводки при выборе */
    position: relative; /* Позиционирование для галочки */
}

.auth-wrap input[type="checkbox"]:checked::after {
    content: ''; /* Галочка */
    position: absolute;
    top: 3px; /* Расположение галочки */
    left: 6px; /* Расположение галочки */
    width: 6px;
    height: 10px;
    border: solid white; /* Цвет галочки */
    border-width: 0 2px 2px 0; /* Толщина линий галочки */
    transform: rotate(45deg); /* Наклон для галочки */
}
</style>